pet_examples/evaluation/model_comp_corr/gpt3/graphviz/simple/3_3.gv
digraph {
    rankdir="LR";
    node [shape=box];
    RegisterClaim -> ExamineClaim;
    ExamineClaim -> WriteRecommendation;
    WriteRecommendation -> CheckRecommendation;
    CheckRecommendation -> OK;
    CheckRecommendation -> NotOK;
    NotOK -> ExamineClaim;
    OK -> Proceed;
}
