pet_examples/evaluation/model_comp_corr/gpt3/mermaid/simple/3_3.mmd
graph LR
A[Register Claim] --> B[Examine Claim]
B --> C[Write Settlement Recommendation]
C --> D[Check Recommendation]
D --> E[OK]
D --> F[Not OK]
F --> B
